#+TEMPLATE: CMU ChemE Thesis
#+key: cmu-cheme-dissertation
#+group: reports
#+contributor: Jacob Boes <jboes@cmu.edu>
#+default-filename: dissertation.org

#+TITLE: Multiscale Modeling of Adsorbate Interactions on Transition Metal Alloy Surfaces
# Must contain middle initial
#+AUTHOR: Jacob Russell Boes
#+DATE: April, 2017

#+latex_class: cmu-cheme-dissertation
#+OPTIONS: H:5 toc:nil ^:{}

#+BEGIN_SRC emacs-lisp :exports none
(add-to-list 'org-latex-classes
             '("cmu-cheme-dissertation"
               "\\documentclass[12pt]{cmuthesis}
\\usepackage[utf8]{inputenc}
\\usepackage{lmodern}
\\usepackage[T1]{fontenc}
\\usepackage{graphicx}
\\usepackage{longtable}
\\usepackage{float}
\\usepackage{wrapfig}
\\usepackage{rotating}
\\usepackage[normalem]{ulem}
\\usepackage{amsmath}
\\usepackage{textcomp}
\\usepackage{marvosym}
\\usepackage{wasysym}
\\usepackage{amssymb}
\\usepackage[superscript,biblabel]{cite}
\\usepackage[version=3]{mhchem}
\\usepackage{url}
\\usepackage{minted}
\\usepackage{underscore}
\\usepackage[linktocpage,oneside,pdfstartview=FitH,colorlinks,
             linkcolor=blue,anchorcolor=blue,
             citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\\usepackage{times}
\\usepackage{fullpage}
\\usepackage{titlesec}
\\usepackage[letterpaper,twoside,bindingoffset=1in,
            left=1in,right=1in,top=1in,bottom=1in]{geometry}
\\usepackage[nottoc,numbib]{tocbibind}

\\titleformat{\\chapter}[display]
   {\\normalfont\\bfseries}{}{0pt}{\\Large}

 [NO-DEFAULT-PACKAGES]
 [PACKAGES]
 [EXTRA]"
               ("\\chapter{%s}" . "\\chapter*{%s}")
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*a{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC

#+RESULTS:
| cmu-cheme-dissertation | \documentclass[12pt]{cmuthesis} |

\maketitle

\frontmatter
\previousdegrees{B.S., Chemical Engineering, Michigan Technological University}

# Abstract should not exceed 350 words.
\begin{abstract}
Transition metals represent some of the first catalysts used in industrial processes and are still used today to produce many of the most needed chemicals. Adopting from ancient metallurgical techniques, it followed that the performance of these basic transition metals can be refined by adding multiple components. Since that time, improvements to these alloy catalysts has been mostly incremental due to the difficulty of producing new catalysts experimentally and a lack of fundamental understanding of the underlying physics.

More recently, computational chemistry has proven itself an increasingly effective means for identifying these underlying physics. Through the use of /d/-band interactions of adsorbates with the surface, basic adsorption characteristics can be predicted across transition metals with limited initial information. However, although these models function well as high-level screening tools, much work is yet to be done before optimal catalysts can be comfortably designed from properties which experimentalists can directly control. This remains particularly challenging for alloy modeling, primarily due to the large number of possible atomic configurations, even for two metal systems.

This work focuses on developing the methods for modeling optimal reaction properties at the surface of a transition metal alloy. Based on thermodynamic equilibrium between the surface, bulk, and gas reservoir, a model for the prediction of segregation under vacuum and adsorbate conditions can be predicted. Furthermore, by relating strain in the bulk lattice constant to the adsorption energies of varying local active sites, the optimal surface compositions can be related to bulk composition; a feature which can easily be selected for. Although useful for identifying trends across bulk composition space, these methods are limited to a small subset of active site configurations.

To capture the complexity of more sophisticated processes, such as segregation, higher-timescale methods are required. Traditional computational tools are often too expensive to implement for these methods, and as such, they are usually completed with less-accurate potentials. In this work, we demonstrate that machine learning techniques have improved accuracy compared to these older potentials. We then go on to demonstrate how this improved accuracy can lead to experimentally accurate predictions of segregation.
\end{abstract}

# Thesis committee must be added to the acknowledgements. The committee chair must be clearly indicated.
\begin{acknowledgments}
John R. Kitchin, Chair \\
Mike Widom \\
Andrew Gellman \\
Erik Yidste
\end{acknowledgments}

\tableofcontents
\listoftables
\listoffigures

\mainmatter
\renewcommand{\baselinestretch}{1.66}\normalsize

